import json

data=[
   {
    "機構名稱": "森美牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "大同里中正路111號1樓、2樓",
    "負責人": "李森孟",
    "電話": "(03)5260203"
  },
  {
    "機構名稱": "黃啟祥牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "和福街105號",
    "負責人": "黃啟祥",
    "電話": "(03)5269095"
  },
  {
    "機構名稱": "福華牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "育英里四維路54號1樓",
    "負責人": "吳英法",
    "電話": "(03)5262345"
  },
  {
    "機構名稱": "親民牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "竹光路２１號",
    "負責人": "黃宏正",
    "電話": "(03)5427027"
  },
  {
    "機構名稱": "如意牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "光田里水田街131號",
    "負責人": "呂正德",
    "電話": "(03)5422765"
  },
  {
    "機構名稱": "僑霖牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "水田街１２０號",
    "負責人": "潘瑞誠",
    "電話": "(03)5330060"
  }
]

with open("data.json", "w", encoding="utf-8") as f:
    json.dump(data, f, indent=4, ensure_ascii=False)

with open("data.json", "r", encoding="utf-8") as f:
    loaded_data = json.load(f)
    for item in loaded_data:
        print(f"機構名稱：{item['機構名稱']}, 電話：{item['電話']}")
        

